_posts/2013-02-12-Using-constrained-optimization-to-find-the-amount-of-each-phase-present.html
---
title: Using constrained optimization to find the amount of each phase present
date: 2013/02/12 09:00:00
categories: [thermodynamics, optimization]
tags: ''
---


<p>
The problem we solve here is that we have several compounds containing Ni and Al, and a bulk mixture of a particular composition of Ni and Al. We want to know which mixture of phases will minimize the total energy. The tricky part is that the optimization is constrained because the mixture of phases must have the overall stoichiometry we want.  We formulate the problem like this.
</p>

<p>
Basically, we want to minimize the function \(E = \sum w_i E_i\), where \(w_i\) is the mass of phase \(i\), and \(E_i\) is the energy per unit mass of phase \(i\). There are some constraints to ensure conservation of mass. Let us consider the following compounds: Al, NiAl, Ni3Al, and Ni, and consider a case where the bulk composition of our alloy is 93.8% Ni and balance Al. We want to know which phases are present, and in what proportions. There are some subtleties in considering the formula and molecular weight of an alloy. We consider the formula with each species amount normalized so the fractions all add up to one. For example, Ni_3Al is represented as Ni_{0.75}Al_{0.25}, and the molecular weight is computed as 0.75*MW_{Ni} + 0.25*MW_{Al}.
</p>

<p>
We use scipy.optimize.fmin_slsqp to solve this problem, and define two equality constraint functions, and the bounds on each weight fraction.
</p>

<p>
Note: the energies in this example were computed by density functional theory at 0K.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #8b0000;">import</span> numpy <span style="color: #8b0000;">as</span> np
<span style="color: #8b0000;">from</span> scipy.optimize <span style="color: #8b0000;">import</span> fmin_slsqp

<span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">these are atomic masses of each species</span>
Ni = 58.693
Al = 26.982

COMPOSITIONS = [<span style="color: #228b22;">'Al'</span>, <span style="color: #228b22;">'NiAl'</span>,              <span style="color: #228b22;">'Ni3Al'</span>,  <span style="color: #228b22;">'Ni'</span>]
MW = np.array(  [Al,  (Ni + Al)/2.0, (3*Ni + Al)/4.0, Ni])

xNi = np.array([0.0, 0.5, 0.75, 1.0])  <span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">mole fraction of nickel in each compd</span>
WNi = xNi*Ni / MW                      <span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">weight fraction of Ni in each cmpd</span>

ENERGIES = np.array([0.0, -0.7, -0.5, 0.0])

BNi = 0.938

<span style="color: #8b0000;">def</span> <span style="color: #8b2323;">G</span>(w):
    <span style="color: #228b22;">'function to minimize. w is a vector of weight fractions, ENERGIES is defined above.'</span>
    <span style="color: #8b0000;">return</span> np.dot(w, ENERGIES)

<span style="color: #8b0000;">def</span> <span style="color: #8b2323;">ec1</span>(w):
    <span style="color: #228b22;">'conservation of Ni constraint'</span>
    <span style="color: #8b0000;">return</span> BNi - np.dot(w, WNi)

<span style="color: #8b0000;">def</span> <span style="color: #8b2323;">ec2</span>(w):
    <span style="color: #228b22;">'weight fractions sum to one constraint'</span>
    <span style="color: #8b0000;">return</span> 1 - np.sum(w)

w0 = np.array([0.0, 0.0, 0.5, 0.5]) <span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">guess weight fractions</span>

y = fmin_slsqp(G,   
               w0,
               eqcons=[ec1, ec2], 
               bounds=[(0,1)]*<span style="color: #8b0000;">len</span>(w0))

<span style="color: #8b0000;">for</span> ci, wi <span style="color: #8b0000;">in</span> <span style="color: #8b0000;">zip</span>(COMPOSITIONS, y):
    <span style="color: #8b0000;">print</span> <span style="color: #228b22;">'{0:8s} {1:+8.2%}'</span>.format(ci, wi)
</pre>
</div>

<pre class="example">
Optimization terminated successfully.    (Exit mode 0)
            Current function value: -0.233299644373
            Iterations: 2
            Function evaluations: 12
            Gradient evaluations: 2
Al         -0.00%
NiAl       +0.00%
Ni3Al     +46.66%
Ni        +53.34%
</pre>

<p>
So, the sample will be about 47% <i>by weight</i> of Ni3Al, and 53% <i>by weight</i> of pure Ni.
</p>

<p>
It may be convenient to formulate this in terms of moles.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #8b0000;">import</span> numpy <span style="color: #8b0000;">as</span> np
<span style="color: #8b0000;">from</span> scipy.optimize <span style="color: #8b0000;">import</span> fmin_slsqp

COMPOSITIONS = [<span style="color: #228b22;">'Al'</span>, <span style="color: #228b22;">'NiAl'</span>, <span style="color: #228b22;">'Ni3Al'</span>,  <span style="color: #228b22;">'Ni'</span>]
xNi = np.array([0.0, 0.5, 0.75, 1.0])   <span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">define this in mole fractions</span>

ENERGIES = np.array([0.0, -0.7, -0.5, 0.0]) 

xNiB = 0.875  <span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">bulk Ni composition</span>

<span style="color: #8b0000;">def</span> <span style="color: #8b2323;">G</span>(n):
    <span style="color: #228b22;">'function to minimize'</span>
    <span style="color: #8b0000;">return</span> np.dot(n, ENERGIES)

<span style="color: #8b0000;">def</span> <span style="color: #8b2323;">ec1</span>(n):
    <span style="color: #228b22;">'conservation of Ni'</span>
    Ntot = np.sum(n)
    <span style="color: #8b0000;">return</span> (Ntot * xNiB) - np.dot(n,  xNi)

<span style="color: #8b0000;">def</span> <span style="color: #8b2323;">ec2</span>(n):
    <span style="color: #228b22;">'mole fractions sum to one'</span>
    <span style="color: #8b0000;">return</span> 1 - np.sum(n)

n0 = np.array([0.0, 0.0, 0.45, 0.55]) <span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">initial guess of mole fractions</span>

y = fmin_slsqp(G,   
               n0,
               eqcons=[ec1, ec2], 
               bounds=[(0, 1)]*(<span style="color: #8b0000;">len</span>(n0)))

<span style="color: #8b0000;">for</span> ci, xi <span style="color: #8b0000;">in</span> <span style="color: #8b0000;">zip</span>(COMPOSITIONS, y):
    <span style="color: #8b0000;">print</span> <span style="color: #228b22;">'{0:8s} {1:+8.2%}'</span>.format(ci, xi)
</pre>
</div>

<pre class="example">
Optimization terminated successfully.    (Exit mode 0)
            Current function value: -0.25
            Iterations: 2
            Function evaluations: 12
            Gradient evaluations: 2
Al         +0.00%
NiAl       -0.00%
Ni3Al     +50.00%
Ni        +50.00%
</pre>

<p>
This means we have a 1:1 molar ratio of Ni and Ni_{0.75}Al_{0.25}. That works out to the overall bulk composition in this particular problem.
</p>

<p>
Let us verify that these two approaches really lead to the same conclusions. On a weight basis we estimate 53.3%wt Ni and 46.7%wt Ni3Al, whereas we predict an equimolar mixture of the two phases. Below we compute the mole fraction of Ni in each case.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">these are atomic masses of each species</span>
Ni = 58.693
Al = 26.982

<span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">Molar case</span>
<span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">1 mol Ni + 1 mol Ni_{0.75}Al_{0.25}</span>
N1 = 1.0; N2 = 1.0
mol_Ni = 1.0 * N1 + 0.75 * N2
xNi = mol_Ni / (N1 + N2)
<span style="color: #8b0000;">print</span> xNi

<span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">Mass case</span>
M1 = 0.533; M2 = 0.467
MW1 = Ni; MW2 = 0.75*Ni + 0.25*Al

xNi2 = (1.0 * M1/MW1 + 0.75 * M2 / MW2) / (M1/MW1 + M2/MW2)
<span style="color: #8b0000;">print</span> xNi2
</pre>
</div>

<pre class="example">
0.875
0.874192746385
</pre>

<p>
You can see the overall mole fraction of Ni is practically the same in each case.
</p>
<p>Copyright (C) 2013 by John Kitchin. See the <a href="/copying.html">License</a> for information about copying.<p><p><a href="/org/2013/02/12/Using-constrained-optimization-to-find-the-amount-of-each-phase-present.org">org-mode source</a><p>